test/good/div-before-mul.cfg.dot
digraph "div-before-mul" {
    node [shape=box];
    subgraph "cluster_test1" {
        label="test1";
        "test1_68" [label="let a: Int = 10"];
        "test1_69" [label="let b: Int = 3"];
        "test1_70" [label="let c: Int = 2"];
        "test1_71" [label="let result: Int = a / b * c"];
        "test1_72" [label="return result",style=filled,fillcolor="#66A7DB"];
        "test1_68" -> "test1_69";
        "test1_69" -> "test1_70";
        "test1_70" -> "test1_71";
        "test1_71" -> "test1_72";
    }
    subgraph "cluster_test2" {
        label="test2";
        "test2_73" [label="let a: Int = 10"];
        "test2_74" [label="let b: Int = 3"];
        "test2_75" [label="let c: Int = 2"];
        "test2_76" [label="let result: Int = a * c / b"];
        "test2_77" [label="return result",style=filled,fillcolor="#66A7DB"];
        "test2_73" -> "test2_74";
        "test2_74" -> "test2_75";
        "test2_75" -> "test2_76";
        "test2_76" -> "test2_77";
    }
    subgraph "cluster_test3" {
        label="test3";
        "test3_78" [label="let a: Int = 10 / 3"];
        "test3_79" [label="let c: Int = 2"];
        "test3_80" [label="let taintedWithA1: Int = 2 - a"];
        "test3_81" [label="let taintedWithA2: Int = 55 + taintedWithA1"];
        "test3_82" [label="let result: Int = taintedWithA2 * c"];
        "test3_83" [label="return result",style=filled,fillcolor="#66A7DB"];
        "test3_78" -> "test3_79";
        "test3_79" -> "test3_80";
        "test3_80" -> "test3_81";
        "test3_81" -> "test3_82";
        "test3_82" -> "test3_83";
    }
}
