test/good/div-before-mul.cfg.mmd
graph TD
subgraph test1
    test1_68["let a: Int = 10"]
    test1_69["let b: Int = 3"]
    test1_70["let c: Int = 2"]
    test1_71["let result: Int = a / b * c"]
    test1_72["return result"]:::exitNode
    test1_68 --> test1_69
    test1_69 --> test1_70
    test1_70 --> test1_71
    test1_71 --> test1_72
end
subgraph test2
    test2_73["let a: Int = 10"]
    test2_74["let b: Int = 3"]
    test2_75["let c: Int = 2"]
    test2_76["let result: Int = a * c / b"]
    test2_77["return result"]:::exitNode
    test2_73 --> test2_74
    test2_74 --> test2_75
    test2_75 --> test2_76
    test2_76 --> test2_77
end
subgraph test3
    test3_78["let a: Int = 10 / 3"]
    test3_79["let c: Int = 2"]
    test3_80["let taintedWithA1: Int = 2 - a"]
    test3_81["let taintedWithA2: Int = 55 + taintedWithA1"]
    test3_82["let result: Int = taintedWithA2 * c"]
    test3_83["return result"]:::exitNode
    test3_78 --> test3_79
    test3_79 --> test3_80
    test3_80 --> test3_81
    test3_81 --> test3_82
    test3_82 --> test3_83
end
